export interface Member {
  id: number;
  name: string;
  designation: string;
  photo: string;
}

export interface FounderData {
  greeting: string;
  orgName: string;
  description: string;
  objective: string;

  callToAction: string;
  members: Member[];
}

export const founderInfo: FounderData = {
  greeting: "🚩 वंदे मातरम्!",
  orgName: "राष्ट्रीय सेवा संघ",
  description:
    "भारत के हर नागरिक तक सेवा पहुँचाने, धर्म और संस्कृति की रक्षा करने के लिए समर्पित है।",
  objective:
    "राष्ट्रभावना, सेवा और एकता को मजबूत करना, और युवा शक्ति को राष्ट्र निर्माण में जोड़ना।",

  callToAction:
    "आप भी इस पवित्र यात्रा में शामिल हों और सेवा के माध्यम से समाज को सशक्त बनाएं।",
  members: [
    {
      id: 1,
      name: "हिमांशु जोशी",
      designation: "संस्थापक, राष्ट्रीय अध्यक्ष",
      photo: "/people/himanshu_joshi.jpg",
    },
    {
      id: 2,
      name: "पू. स्वामी श्री दर्शन भारती जी",
      designation: "मुख्य संरक्षक",
      photo: "/people/darshan.jpg",
    },
    {
      id: 3,
      name: "पू. योगी श्री आदित्यनाथ जी",
      designation: "प्रेरणा स्रोत",
      photo: "/people/yogi_ji.jpg",
    },
    {
      id: 4,
      name: "प. पू. डॉ. केशव बलिराम हेडगेवार जी",
      designation: "मुख्य प्रेरणा स्रोत",
      photo: "/people/keshav_ji.jpg",
    },
    {
      id: 5,
      name: "श्री पवन जोशी",
      designation: " रा. वरिष्ठ उपाध्यक्ष",
      photo: "/people/pawan_joshi.jpg",
    },
    {
      id: 6,
      name: "श्री सुनील दत्त पंत ",
      designation: "रा. संगठन मंत्री",
      photo: "/people/sunil_datt.jpg",
    },
    {
      id: 7,
      name: "श्री वेदमणि शुक्ला",
      designation: "रा. महामंत्री",
      photo: "/people/vedmani.jpg",
    },
    {
      id: 8,
      name: "श्री बी. प्रसाद जोशी",
      designation: "रा. सचिव",
      photo: "/people/prashad.jpg",
    },
  ],
};
